# Задача 20: В настольной игре Скрабл (Scrabble) каждая буква имеет определенную
# ценность. В случае с английским алфавитом очки распределяются так:
# ● A, E, I, O, U, L, N, S, T, R – 1 очко;
# ● D, G – 2 очка;
# ● B, C, M, P – 3 очка;
# ● F, H, V, W, Y – 4 очка;
# ● K – 5 очков;
# ● J, X – 8 очков;
# ● Q, Z – 10 очков.
# А русские буквы оцениваются так:
# ● А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# ● Д, К, Л, М, П, У – 2 очка;
# ● Б, Г, Ё, Ь, Я – 3 очка;
# ● Й, Ы – 4 очка;
# ● Ж, З, Х, Ц, Ч – 5 очков;
# ● Ш, Э, Ю – 8 очков;
# ● Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только
# английские, либо только русские буквы.


def scrabble(word: str) -> int:
    """Посчет очков в игре Скрабл"""
    points = 0
    one = ("A", "E", "I", "O", "U", "L", "N", "S", 
           "T", "R", "А", "В", "Е", "И", "Н", "О", "Р", "С", "Т")
    two = ("D", "G", "Д", "К", "Л", "М", "П", "У")
    three = ("B", "C", "M", "P", "Б", "Г", "Ё", "Ь", "Я")
    four = ("K", "Й", "Ы")
    five = ("J", "X", "Ж", "З", "Х", "Ц", "Ч")
    eight = ("J", "X", "Ш", "Э", "Ю")
    ten = ("Q", "Z", "Ф", "Щ", "Ъ")
    for char in word.upper():
        if char in one:
            points += 1
        elif char in two:
            points += 2
        elif char in three:
            points += 3
        elif char in four:
            points += 4
        elif char in five:
            points += 5
        elif char in eight:
            points += 8
        elif char in ten:
            points += 10
    return points


word = input("Введите слово: \n")
print(scrabble(word))